[
	{
		"color": "red",
		"imgSrc": "/images/darth-vader.svg",
		"altText": "Darth Vader",
		"title": "Darth Vader",
		"description": "Vader's lightsaber shares similarities with his previous hilt as Anakin Skywalker, but has been customized with a more aggressive design, dual crystals, and adjustable blade length suited to his brutally powerful Form V fighting style.",
		"className": ""
	},
	{
		"color": "blue",
		"imgSrc": "/images/obi-wan-kenobi.svg",
		"altText": "Obi-Wan Kenobi",
		"title": "Obi-Wan Kenobi",
		"description": "Obi-Wan wielded this lightsaber from Attack of the Clones through his duel with Vader on the Death Star. The new hilt design represents Obi-Wan's progression and increased mastery as a Jedi. It moves away from the simple design, inspired by Qui-Gon, that Obi-Wan used as a Padawan.",
		"className": ""
	},
	{
		"color": "purple",
		"imgSrc": "/images/mace-windu.svg",
		"altText": "Mace Windu",
		"title": "Mace Windu",
		"description": "Mace Windu's lightsaber featured an electrum-plated hilt, signifying his senior status on the Jedi Council. The distinct amethyst/purple blade was produced by a specialized kyber crystal.",
		"className": ""
	},
	{
		"color": "red",
		"imgSrc": "/images/darth-maul.svg",
		"altText": "Darth Maul",
		"title": "Darth Maul",
		"description": "Darth Maul wielded an iconic double-bladed lightsaber, with two hilts connected together, producing two blades when deployed. This unique design allowed for versatile fighting styles, extended reach, and an intimidating spinning display, but compromised defensive capabilities and mobility compared to single-bladed lightsabers.",
		"className": "long"
	},
	{
		"color": "yellow",
		"imgSrc": "/images/rey2.svg",
		"altText": "Rey",
		"title": "Rey",
		"description": "Rey's unique lightsaber hilt pays homage to her scavenger origins, while the yellow blade represents her role as the first of a new Jedi Order. The rotating activation that flashed green and blue before igniting yellow is an innovative feature not seen on most lightsabers.",
		"className": ""
	},
	{
		"color": "green",
		"imgSrc": "/images/luke-skywalker.svg",
		"altText": "Luke Skywalker",
		"title": "Luke Skywalker",
		"description": "Luke modeled this new lightsaber hilt after Obi-Wan's as a tribute, using salvaged materials to construct it after losing Anakin's blue saber on Bespin. It has adjustable blade length and defensive capabilities for intense dueling against opponents like Vader and the Emperor.",
		"className": ""
	},
	{
		"color": "red",
		"imgSrc": "/images/kylo-ren.svg",
		"altText": "Kylo Ren",
		"title": "Kylo Ren",
		"description": "Kylo's unique crossguard design with quillon plasma vents, allowing for added protection and leverage in combat. The unstable, flickering blade was caused by a cracked kyber crystal. The quillon vents acted as lateral plasma channels for the unstable crystal.",
		"className": "wide"
	},
	{
		"color": "green",
		"imgSrc": "/images/yoda.svg",
		"altText": "Yoda",
		"title": "Yoda",
		"description": "Yoda's lightsaber was designed with a compact size to match his small stature, yet remained an elegant and powerful weapon. Its green blade represented Yoda's attunement to the living Force and the light side. The hilt's simple design belied the incredible skill of its master in the ancient lightsaber forms.",
		"className": ""
	},
	{
		"color": "red",
		"imgSrc": "/images/count-dooku.svg",
		"altText": "Count Dooku",
		"title": "Count Dooku",
		"description": "Dooku's curved hilt was designed for the precision and mobility of Form II (Makashi) lightsaber combat, allowing him to slash and lunge with great dexterity. The unique design was controversial among the Jedi Order, as Yoda felt it reflected Dooku's obsession with dueling prowess over Jedi ideals.",
		"className": "wide"
	},
	{
		"color": "blue",
		"imgSrc": "/images/anakin-skywalker.svg",
		"altText": "Anakin Skywalker",
		"title": "Anakin Skywalker",
		"description": "Anakin's Episode II hilt has a smooth emitter shroud design compared to the more angled shroud on the later Episode III version. It also features two small illuminating LED lights not present on the Episode III hilt. The blade dimensions, adjustable length, and ridged grip allow for ideal dueling performance and control.",
		"className": ""
	},
	{
		"color": "green",
		"imgSrc": "/images/qui-gon.svg",
		"altText": "Qui-Gon Jinn",
		"title": "Qui-Gon Jinn",
		"description": "Qui-Gon's iconic lightsaber had a distinct curved grip hilt made of alloy, utilized a green kyber crystal. The green-bladed lightsaber was constructed by Qui-Gon to resemble the weapon of his former master, Count Dooku.",
		"className": ""
	},
	{
		"color": "red",
		"imgSrc": "/images/darth-siduous.svg",
		"altText": "Darth Sidious",
		"title": "Darth Sidious",
		"description": "Sidious' curved hilt allowed for precise strikes and mobility fitting his mastery of Form VII lightsaber combat. The adjustable red blade length and defusing finish made it suitable for intense dueling bouts against skilled opponents like Yoda and Mace Windu. Overall, Sidious' lightsaber reflected his prowess as a Sith Lord through its menacing yet elegant design.",
		"className": ""
	}
]
